read_verilog counter.v
hierarchy -check -top counter
proc
flatten
opt_expr
opt_clean
check
opt -nodffe -nosdff
fsm
opt
wreduce
peepopt
opt_clean
opt
memory -nomap
opt_clean
opt -fast -full
memory_map
opt -full
techmap
opt -fast
abc -fast -g OR
opt -fast
hierarchy -check
stat
check
show -format svg -width
write_json test.json